<?php
/**
 * 上传相关配置
 */
return [
        //存储上传文件的物理文件目录
        'dir'=>DIR_ROOT.'Public/Upload/',
        
        //用户访问上传文件的Web路径
        'path'=>'/Upload/',

        // 上传文件大小限制
        'maxSize' => 20000000,
        
        // 上传视频大小限制
        'videoMaxSize' => 500000000,

        // apk文件大小限制
        'apkMaxSize' => 200000000,

        //图片缩略图
        'thumbs' => [
                //每一个缩略图,名称无所谓
                '200小图' => [
                        
                        //高
                        'height' => 1000,
                        
                        //宽
                        'width' => 1000,
                        
                        //缩略图前缀
                        'prefix' => '200_',
                        
                        // 等比缩放填充|等比缩放留空|等比裁剪|拉伸
                        'type' => '等比缩放填充'
                ]
        ]
];